# Group by

In [10]:
import pandas as pd

comp = pd.DataFrame({
    "Name":["Manish" ,"Deepak" ,"Anand"],
    "Id":[1,2,3],
    "Address":["Mum" ,"Pune" ,"Goa"]
})

comp

     Name  Id Address
0  Manish   1     Mum
1  Deepak   2    Pune
2   Anand   3     Goa

In [11]:
emp = pd.DataFrame({
    "ComName":["CG" ,"TCS","Info"],
    "TotalEmp":[100,200,300]
})

emp

  ComName  TotalEmp
0      CG       100
1     TCS       200
2    Info       300

In [16]:
con = pd.concat([comp,emp] ,ignore_index=True)

con

C:\Users\mantiwar\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  Address ComName   Id    Name  TotalEmp
0     Mum     NaN  1.0  Manish       NaN
1    Pune     NaN  2.0  Deepak       NaN
2     Goa     NaN  3.0   Anand       NaN
3     NaN      CG  NaN     NaN     100.0
4     NaN     TCS  NaN     NaN     200.0
5     NaN    Info  NaN     NaN     300.0

In [40]:
dd = con.fillna({
    "ComName":"Not regis",
    "Name":"Unknow",
    "TotalEmp":10,
    "Address":"local"
})

dd

  Address    ComName   Id    Name  TotalEmp
0     Mum  Not regis  1.0  Manish      10.0
1    Pune  Not regis  2.0  Deepak      10.0
2     Goa  Not regis  3.0   Anand      10.0
3   local         CG  NaN  Unknow     100.0
4   local        TCS  NaN  Unknow     200.0
5   local       Info  NaN  Unknow     300.0

In [41]:
grDat = dd.groupby('Address')

grDat

In [42]:
for addr ,a in grDat:
    print(addr)
    print(a)

Goa
  Address    ComName   Id   Name  TotalEmp
2     Goa  Not regis  3.0  Anand      10.0
Mum
  Address    ComName   Id    Name  TotalEmp
0     Mum  Not regis  1.0  Manish      10.0
Pune
  Address    ComName   Id    Name  TotalEmp
1    Pune  Not regis  2.0  Deepak      10.0
local
  Address ComName  Id    Name  TotalEmp
3   local      CG NaN  Unknow     100.0
4   local     TCS NaN  Unknow     200.0
5   local    Info NaN  Unknow     300.0